cmsis-svd/cmsis-svd/data/Infineon/s6e2hexg.svd
        <!-- REGISTER "IRQ003MON" -->
        <register>
          <name>IRQ003MON</name>
          <description>IRQ003 Batch Read Register</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IRQBIT15" -->
            <field>
              <name>IRQBIT15</name>
              <description>interrupt request of the interrupt selected in bit of IRQ003SEL Register</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT14" -->
            <field>
              <name>IRQBIT14</name>
              <description>interrupt request of the interrupt selected in bit of IRQ003SEL Register</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT13" -->
            <field>
              <name>IRQBIT13</name>
              <description>interrupt request of the interrupt selected in bit of IRQ003SEL Register</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT12" -->
            <field>
              <name>IRQBIT12</name>
              <description>interrupt request of the interrupt selected in bit of IRQ003SEL Register</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT11" -->
            <field>
              <name>IRQBIT11</name>
              <description>interrupt request of the interrupt selected in bit of IRQ003SEL Register</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT10" -->
            <field>
              <name>IRQBIT10</name>
              <description>interrupt request of the interrupt selected in bit of IRQ003SEL Register</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT9" -->
            <field>
              <name>IRQBIT9</name>
              <description>interrupt request of the interrupt selected in bit of IRQ003SEL Register</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT8" -->
            <field>
              <name>IRQBIT8</name>
              <description>interrupt request of the interrupt selected in bit of IRQ003SEL Register</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT7" -->
            <field>
              <name>IRQBIT7</name>
              <description>interrupt request of the interrupt selected in bit7 of IRQ003SEL Register</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT6" -->
            <field>
              <name>IRQBIT6</name>
              <description>interrupt request of the interrupt selected in bit6 of IRQ003SEL Register</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT5" -->
            <field>
              <name>IRQBIT5</name>
              <description>interrupt request of the interrupt selected in bit5 of IRQ003SEL Register</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT4" -->
            <field>
              <name>IRQBIT4</name>
              <description>interrupt request of the interrupt selected in bit4 of IRQ003SEL Register</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT3" -->
            <field>
              <name>IRQBIT3</name>
              <description>interrupt request of the interrupt selected in bit3 of IRQ003SEL Register</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT2" -->
            <field>
              <name>IRQBIT2</name>
              <description>interrupt request of the interrupt selected in bit2 of IRQ003SEL Register</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT1" -->
            <field>
              <name>IRQBIT1</name>
              <description>interrupt request of the interrupt selected in bit1 of IRQ003SEL Register</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT0" -->
            <field>
              <name>IRQBIT0</name>
              <description>interrupt request of the interrupt selected in bit0 of IRQ003SEL Register</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ004MON" -->
        <register>
          <name>IRQ004MON</name>
          <description>IRQ004 Batch Read Register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IRQBIT15" -->
            <field>
              <name>IRQBIT15</name>
              <description>interrupt request of the interrupt selected in bit of IRQ004SEL Register</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT14" -->
            <field>
              <name>IRQBIT14</name>
              <description>interrupt request of the interrupt selected in bit of IRQ004SEL Register</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT13" -->
            <field>
              <name>IRQBIT13</name>
              <description>interrupt request of the interrupt selected in bit of IRQ004SEL Register</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT12" -->
            <field>
              <name>IRQBIT12</name>
              <description>interrupt request of the interrupt selected in bit of IRQ004SEL Register</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT11" -->
            <field>
              <name>IRQBIT11</name>
              <description>interrupt request of the interrupt selected in bit of IRQ004SEL Register</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT10" -->
            <field>
              <name>IRQBIT10</name>
              <description>interrupt request of the interrupt selected in bit of IRQ004SEL Register</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT9" -->
            <field>
              <name>IRQBIT9</name>
              <description>interrupt request of the interrupt selected in bit of IRQ004SEL Register</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT8" -->
            <field>
              <name>IRQBIT8</name>
              <description>interrupt request of the interrupt selected in bit of IRQ004SEL Register</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT7" -->
            <field>
              <name>IRQBIT7</name>
              <description>interrupt request of the interrupt selected in bit7 of IRQ004SEL Register</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT6" -->
            <field>
              <name>IRQBIT6</name>
              <description>interrupt request of the interrupt selected in bit6 of IRQ004SEL Register</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT5" -->
            <field>
              <name>IRQBIT5</name>
              <description>interrupt request of the interrupt selected in bit5 of IRQ004SEL Register</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT4" -->
            <field>
              <name>IRQBIT4</name>
              <description>interrupt request of the interrupt selected in bit4 of IRQ004SEL Register</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT3" -->
            <field>
              <name>IRQBIT3</name>
              <description>interrupt request of the interrupt selected in bit3 of IRQ004SEL Register</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT2" -->
            <field>
              <name>IRQBIT2</name>
              <description>interrupt request of the interrupt selected in bit2 of IRQ004SEL Register</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT1" -->
            <field>
              <name>IRQBIT1</name>
              <description>interrupt request of the interrupt selected in bit1 of IRQ004SEL Register</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT0" -->
            <field>
              <name>IRQBIT0</name>
              <description>interrupt request of the interrupt selected in bit0 of IRQ004SEL Register</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ005MON" -->
        <register>
          <name>IRQ005MON</name>
          <description>IRQ005 Batch Read Register</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IRQBIT15" -->
            <field>
              <name>IRQBIT15</name>
              <description>interrupt request of the interrupt selected in bit of IRQ005SEL Register</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT14" -->
            <field>
              <name>IRQBIT14</name>
              <description>interrupt request of the interrupt selected in bit of IRQ005SEL Register</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT13" -->
            <field>
              <name>IRQBIT13</name>
              <description>interrupt request of the interrupt selected in bit of IRQ005SEL Register</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT12" -->
            <field>
              <name>IRQBIT12</name>
              <description>interrupt request of the interrupt selected in bit of IRQ005SEL Register</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT11" -->
            <field>
              <name>IRQBIT11</name>
              <description>interrupt request of the interrupt selected in bit of IRQ005SEL Register</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT10" -->
            <field>
              <name>IRQBIT10</name>
              <description>interrupt request of the interrupt selected in bit of IRQ005SEL Register</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT9" -->
            <field>
              <name>IRQBIT9</name>
              <description>interrupt request of the interrupt selected in bit of IRQ005SEL Register</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT8" -->
            <field>
              <name>IRQBIT8</name>
              <description>interrupt request of the interrupt selected in bit of IRQ005SEL Register</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT7" -->
            <field>
              <name>IRQBIT7</name>
              <description>interrupt request of the interrupt selected in bit7 of IRQ005SEL Register</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT6" -->
            <field>
              <name>IRQBIT6</name>
              <description>interrupt request of the interrupt selected in bit6 of IRQ005SEL Register</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT5" -->
            <field>
              <name>IRQBIT5</name>
              <description>interrupt request of the interrupt selected in bit5 of IRQ005SEL Register</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT4" -->
            <field>
              <name>IRQBIT4</name>
              <description>interrupt request of the interrupt selected in bit4 of IRQ005SEL Register</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT3" -->
            <field>
              <name>IRQBIT3</name>
              <description>interrupt request of the interrupt selected in bit3 of IRQ005SEL Register</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT2" -->
            <field>
              <name>IRQBIT2</name>
              <description>interrupt request of the interrupt selected in bit2 of IRQ005SEL Register</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT1" -->
            <field>
              <name>IRQBIT1</name>
              <description>interrupt request of the interrupt selected in bit1 of IRQ005SEL Register</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT0" -->
            <field>
              <name>IRQBIT0</name>
              <description>interrupt request of the interrupt selected in bit0 of IRQ005SEL Register</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ006MON" -->
        <register>
          <name>IRQ006MON</name>
          <description>IRQ006 Batch Read Register</description>
          <addressOffset>0x21C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IRQBIT15" -->
            <field>
              <name>IRQBIT15</name>
              <description>interrupt request of the interrupt selected in bit of IRQ006SEL Register</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT14" -->
            <field>
              <name>IRQBIT14</name>
              <description>interrupt request of the interrupt selected in bit of IRQ006SEL Register</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT13" -->
            <field>
              <name>IRQBIT13</name>
              <description>interrupt request of the interrupt selected in bit of IRQ006SEL Register</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT12" -->
            <field>
              <name>IRQBIT12</name>
              <description>interrupt request of the interrupt selected in bit of IRQ006SEL Register</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT11" -->
            <field>
              <name>IRQBIT11</name>
              <description>interrupt request of the interrupt selected in bit of IRQ006SEL Register</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT10" -->
            <field>
              <name>IRQBIT10</name>
              <description>interrupt request of the interrupt selected in bit of IRQ006SEL Register</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT9" -->
            <field>
              <name>IRQBIT9</name>
              <description>interrupt request of the interrupt selected in bit of IRQ006SEL Register</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT8" -->
            <field>
              <name>IRQBIT8</name>
              <description>interrupt request of the interrupt selected in bit of IRQ006SEL Register</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT7" -->
            <field>
              <name>IRQBIT7</name>
              <description>interrupt request of the interrupt selected in bit7 of IRQ006SEL Register</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT6" -->
            <field>
              <name>IRQBIT6</name>
              <description>interrupt request of the interrupt selected in bit6 of IRQ006SEL Register</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT5" -->
            <field>
              <name>IRQBIT5</name>
              <description>interrupt request of the interrupt selected in bit5 of IRQ006SEL Register</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT4" -->
            <field>
              <name>IRQBIT4</name>
              <description>interrupt request of the interrupt selected in bit4 of IRQ006SEL Register</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT3" -->
            <field>
              <name>IRQBIT3</name>
              <description>interrupt request of the interrupt selected in bit3 of IRQ006SEL Register</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT2" -->
            <field>
              <name>IRQBIT2</name>
              <description>interrupt request of the interrupt selected in bit2 of IRQ006SEL Register</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT1" -->
            <field>
              <name>IRQBIT1</name>
              <description>interrupt request of the interrupt selected in bit1 of IRQ006SEL Register</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT0" -->
            <field>
              <name>IRQBIT0</name>
              <description>interrupt request of the interrupt selected in bit0 of IRQ006SEL Register</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
